extension/test/resources/payment-credit-card.json

{
  "interfaceId":"paymentReferenceId",
  "amountPlanned": {
    "type": "centPrecision",
    "currencyCode": "EUR",
    "centAmount": 595,
    "fractionDigits": 2
  },
  "paymentMethodInfo": {
    "paymentInterface": "ctp-adyen-integration",
    "method": "creditCard"
  },
  "custom": {
    "type": {
      "typeId": "type",
      "key": "ctp-adyen-integration-credit-card"
    },
    "fields": {
      "countryCode": "DE",
      "encryptedCardNumber":"${encryptedCardNumber}",
      "encryptedExpiryMonth":"${encryptedExpiryMonth}",
      "encryptedExpiryYear":"${encryptedExpiryYear}",
      "encryptedSecurityCode":"${encryptedSecurityCode}",
      "returnUrl":"https://your-company.com/checkout/"
    }
  },
  "paymentStatus": {},
  "transactions": [
    {
      "type": "Charge",
      "amount": {
        "type": "centPrecision",
        "currencyCode": "EUR",
        "centAmount": 495,
        "fractionDigits": 2
      },
      "state": "Initial"
    }
  ],
  "interfaceInteractions": [
  ]
}